In [1]:
import pandas as pd
df = pd.read_csv('../Files/employees.csv', parse_dates=['Start Date','Last Login Time'])
df['Senior Management'] = df['Senior Management'].astype('bool')
df['Gender'] = df['Gender'].astype('category')
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2021-05-31 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2021-05-31 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2021-05-31 11:17:00,130590,11.858,False,Finance

In [2]:
conditon1 = df['Team'].isnull()
df[conditon1]

condition2 = df['Gender'].notnull()
df[condition2]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2021-05-31 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2021-05-31 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2021-05-31 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2021-05-31 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2021-05-31 16:47:00,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
994,George,Male,2013-06-21,2021-05-31 17:47:00,98874,4.479,True,Marketing
996,Phillip,Male,1984-01-31,2021-05-31 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2021-05-31 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2021-05-31 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2021-05-31 18:24:00,129949,10.169,True,Sales

In [3]:
# The .between() Method

In [4]:
condition = df['Salary'].between(60000,70000)
df[condition]

df[df['Bonus %'].between(2.0,5.0)]
df[df['Start Date'].between('1991-01-01','1992-01-01') & df['Salary'].between(60000,70000)]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
88,Donna,Female,1991-11-27,2021-05-31 13:59:00,64088,6.155,True,Legal
704,Thomas,Male,1991-09-07,2021-05-31 09:51:00,65251,11.211,False,Distribution
909,Donald,Male,1991-08-01,2021-05-31 02:25:00,61999,6.466,False,Product

In [5]:
df[df['Last Login Time'].between('08:30AM','12:00PM')]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,2021-05-31 11:17:00,130590,11.858,False,Finance
7,NaN,Female,2015-07-20,2021-05-31 10:43:00,45906,11.598,True,Finance
10,Louise,Female,1980-08-12,2021-05-31 09:01:00,63241,15.132,True,NaN
18,Diana,Female,1981-10-23,2021-05-31 10:27:00,132940,19.082,False,Client Services
33,Jean,Female,1993-12-18,2021-05-31 09:07:00,119082,16.180,False,Business Development
...,...,...,...,...,...,...,...,...
963,Ann,Female,1994-09-23,2021-05-31 11:15:00,89443,17.940,True,Sales
977,Sarah,Female,1995-12-04,2021-05-31 09:16:00,124566,5.949,False,Product
982,Rose,Female,1982-04-06,2021-05-31 10:43:00,91411,8.639,True,Human Resources
988,Alice,Female,2004-10-05,2021-05-31 09:34:00,47638,11.209,False,Human Resources
992,Anthony,Male,2011-10-16,2021-05-31 08:35:00,112769,11.625,True,Finance

In [6]:
# .duplicated() Method

In [7]:
df = pd.read_csv('../Files/employees.csv', parse_dates=['Start Date','Last Login Time'])
df['Senior Management'] = df['Senior Management'].astype('bool')
df['Gender'] = df['Gender'].astype('category')
df.sort_values("First Name", inplace=True)
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2021-05-31 10:20:00,61602,11.849,True,Marketing
327,Aaron,Male,1994-01-29,2021-05-31 18:48:00,58755,5.097,True,Marketing
440,Aaron,Male,1990-07-22,2021-05-31 14:53:00,52119,11.343,True,Client Services

In [8]:
df[df['First Name'].duplicated() == False]
df2 = df[~df['First Name'].duplicated(keep=False)]
df2.sort_values(['Start Date','First Name'],ascending=[False,True])

len(df)

1000

In [9]:
len(df.drop_duplicates())

1000

In [11]:
df.drop_duplicates()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2021-05-31 10:20:00,61602,11.849,True,Marketing
327,Aaron,Male,1994-01-29,2021-05-31 18:48:00,58755,5.097,True,Marketing
440,Aaron,Male,1990-07-22,2021-05-31 14:53:00,52119,11.343,True,Client Services
937,Aaron,NaN,1986-01-22,2021-05-31 19:39:00,63126,18.424,False,Client Services
137,Adam,Male,2011-05-21,2021-05-31 01:45:00,95327,15.120,False,Distribution
...,...,...,...,...,...,...,...,...
902,NaN,Male,2001-05-23,2021-05-31 19:52:00,103877,6.322,True,Distribution
925,NaN,Female,2000-08-23,2021-05-31 16:19:00,95866,19.388,True,Sales
946,NaN,Female,1985-09-15,2021-05-31 01:50:00,133472,16.941,True,Distribution
947,NaN,Male,2012-07-30,2021-05-31 15:07:00,107351,5.329,True,Marketing
951,NaN,Female,2010-09-14,2021-05-31 05:19:00,143638,9.662,True,NaN

In [15]:
df.drop_duplicates(subset=["First Name"], keep=False)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
8,Angela,Female,2005-11-22,2021-05-31 06:29:00,95570,18.523,True,Engineering
688,Brian,Male,2007-04-07,2021-05-31 22:47:00,93901,17.821,True,Legal
190,Carol,Female,1996-03-19,2021-05-31 03:39:00,57783,9.129,False,Finance
887,David,Male,2009-12-05,2021-05-31 08:48:00,92242,15.407,False,Legal
5,Dennis,Male,1987-04-18,2021-05-31 01:35:00,115163,10.125,False,Legal
495,Eugene,Male,1984-05-24,2021-05-31 10:54:00,81077,2.117,False,Sales
33,Jean,Female,1993-12-18,2021-05-31 09:07:00,119082,16.180,False,Business Development
832,Keith,Male,2003-02-12,2021-05-31 15:02:00,120672,19.467,False,Legal
291,Tammy,Female,1984-11-11,2021-05-31 10:30:00,132839,17.463,True,Client Services

In [22]:
df.drop_duplicates(subset=['First Name','Team'], inplace=True)

In [24]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2021-05-31 10:20:00,61602,11.849,True,Marketing
440,Aaron,Male,1990-07-22,2021-05-31 14:53:00,52119,11.343,True,Client Services
137,Adam,Male,2011-05-21,2021-05-31 01:45:00,95327,15.120,False,Distribution
141,Adam,Male,1990-12-24,2021-05-31 20:57:00,110194,14.727,True,Product
302,Adam,Male,2007-07-05,2021-05-31 11:59:00,71276,5.027,True,Human Resources

In [25]:
len(df)

769

In [26]:
# The .unique() and .nunique() Methods

In [27]:
df = pd.read_csv('../Files/employees.csv', parse_dates=['Start Date','Last Login Time'])
df['Senior Management'] = df['Senior Management'].astype('bool')
df['Gender'] = df['Gender'].astype('category')
df.sort_values("First Name", inplace=True)
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2021-05-31 10:20:00,61602,11.849,True,Marketing
327,Aaron,Male,1994-01-29,2021-05-31 18:48:00,58755,5.097,True,Marketing
440,Aaron,Male,1990-07-22,2021-05-31 14:53:00,52119,11.343,True,Client Services

In [29]:
df['Gender'].unique()

[Male, NaN, Female]
Categories (2, object): [Male, Female]

In [34]:
len(df['Team'].unique())

11

In [37]:
df['Team'].nunique(dropna=False)
df['Team'].nunique()

10